In [1]:
import pandas as pd

In [2]:
dati = pd.read_excel("dati/ElettronicaConsumo_2fogli.xlsx")

In [3]:
dati

               Product  Price
0     Desktop Computer    700
1               Tablet    250
2              iPhone8    800
3               Laptop   1200
4             iPhone10   1200
5               Huawei    900
6  Auricolare Wireless    150

In [10]:
dati_f2 = pd.read_excel("dati/ElettronicaConsumo_2fogli.xlsx", sheet_name = "Foglio2")

In [11]:
dati_f2

      Product  Price
0       Pants    100
1      Jacket    250
2     T-shirt     80
3       Skirt    120
4   Pull-over    125
5       Shoes    190
6  Nightshirt     50

In [13]:
dati_f1 = pd.read_excel("dati/ElettronicaConsumo_2fogli.xlsx", sheet_name = 0)
dati_f1

               Product  Price
0     Desktop Computer    700
1               Tablet    250
2              iPhone8    800
3               Laptop   1200
4             iPhone10   1200
5               Huawei    900
6  Auricolare Wireless    150

In [16]:
for i in range(2):
    dati_f2 = pd.read_excel("dati/ElettronicaConsumo_2fogli.xlsx", sheet_name = i)
    print(dati_f2)

               Product  Price
0     Desktop Computer    700
1               Tablet    250
2              iPhone8    800
3               Laptop   1200
4             iPhone10   1200
5               Huawei    900
6  Auricolare Wireless    150
      Product  Price
0       Pants    100
1      Jacket    250
2     T-shirt     80
3       Skirt    120
4   Pull-over    125
5       Shoes    190
6  Nightshirt     50

In [ ]:
pd.read